In [1]:
import pandas as pd

# Criando alunos para a Escola

## Exportando lista JSON

In [2]:

nomes_m = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=m')
nomes_f = pd.read_json('https://servicodados.ibge.gov.br/api/v1/censos/nomes/ranking?qtd=200&sexo=f')

In [3]:
print("Quantidade de nomes: " +str(len(nomes_f)+(len(nomes_m))))

Quantidade de nomes: 400

In [4]:
nomes_m

          nome  regiao     freq  rank sexo
0         JOSE       0  5732508     1    M
1         JOAO       0  2971935     2    M
2      ANTONIO       0  2567494     3    M
3    FRANCISCO       0  1765197     4    M
4       CARLOS       0  1483121     5    M
..         ...     ...      ...   ...  ...
195     WALTER       0    67207   196    M
196    ARLINDO       0    66669   197    M
197    MICHAEL       0    65736   198    M
198     ALVARO       0    65444   199    M
199    GEOVANE       0    65435   200    M

[200 rows x 5 columns]

In [5]:
nomes_f

          nome  regiao      freq  rank sexo
0        MARIA       0  11694738     1    F
1          ANA       0   3079729     2    F
2    FRANCISCA       0    721637     3    F
3      ANTONIA       0    588783     4    F
4      ADRIANA       0    565621     5    F
..         ...     ...       ...   ...  ...
195     ROSANE       0     82203   196    F
196    IVONETE       0     81878   197    F
197    LUCIANE       0     81230   198    F
198    ISADORA       0     81100   199    F
199      NILZA       0     80128   200    F

[200 rows x 5 columns]

In [6]:
frames = [nomes_f, nomes_m]

In [7]:
frames

[          nome  regiao      freq  rank sexo
 0        MARIA       0  11694738     1    F
 1          ANA       0   3079729     2    F
 2    FRANCISCA       0    721637     3    F
 3      ANTONIA       0    588783     4    F
 4      ADRIANA       0    565621     5    F
 ..         ...     ...       ...   ...  ...
 195     ROSANE       0     82203   196    F
 196    IVONETE       0     81878   197    F
 197    LUCIANE       0     81230   198    F
 198    ISADORA       0     81100   199    F
 199      NILZA       0     80128   200    F

 [200 rows x 5 columns],
           nome  regiao     freq  rank sexo
 0         JOSE       0  5732508     1    M
 1         JOAO       0  2971935     2    M
 2      ANTONIO       0  2567494     3    M
 3    FRANCISCO       0  1765197     4    M
 4       CARLOS       0  1483121     5    M
 ..         ...     ...      ...   ...  ...
 195     WALTER       0    67207   196    M
 196    ARLINDO       0    66669   197    M
 197    MICHAEL       0    65736   198    M
 198     ALVARO       0    65444   199    M
 199    GEOVANE       0    65435   200    M

 [200 rows x 5 columns]]

In [8]:
nomes = pd.concat(frames)['nome'].to_frame()

In [9]:
nomes.sample(5)

         nome
74      LAURA
25   LEONARDO
185    SHEILA
25    BEATRIZ
72   CAROLINE

In [10]:
nomes

          nome
0        MARIA
1          ANA
2    FRANCISCA
3      ANTONIA
4      ADRIANA
..         ...
195     WALTER
196    ARLINDO
197    MICHAEL
198     ALVARO
199    GEOVANE

[400 rows x 1 columns]

In [11]:
nomes.shape

(400, 1)

In [12]:
nomes.index = range(nomes.shape[0])

In [13]:
nomes

          nome
0        MARIA
1          ANA
2    FRANCISCA
3      ANTONIA
4      ADRIANA
..         ...
395     WALTER
396    ARLINDO
397    MICHAEL
398     ALVARO
399    GEOVANE

[400 rows x 1 columns]

## Incluindo ID dos Alunos

In [16]:
import numpy as np
np.random.seed(123)

In [17]:
total_alunos = len(nomes)
total_alunos

400

In [18]:
nomes['id_alunos'] = np.random.permutation(total_alunos) + 1

In [19]:
nomes.sample(5)

          nome  id_alunos
188    POLIANA        369
57      DAIANE        303
203  FRANCISCO        382
382    CHARLES         33
230   ANDERSON        111

In [21]:
dominios = ['@dominiodoemail.com.br','@servicodoemail.com']
nomes['dominio'] = np.random.choice(dominios,total_alunos)

In [22]:
 nomes.sample(5)

          nome  id_alunos                 dominio
284   SEVERINO         78  @dominiodoemail.com.br
200       JOSE        331     @servicodoemail.com
379       IAGO        340  @dominiodoemail.com.br
10      SANDRA        174  @dominiodoemail.com.br
171  TERESINHA         45  @dominiodoemail.com.br

In [23]:
nomes['email'] = nomes.nome.str.cat(nomes.dominio).str.lower()

In [24]:
nomes.sample(5)

       nome  id_alunos                 dominio                         email
314  ARTHUR        320  @dominiodoemail.com.br  arthur@dominiodoemail.com.br
57   DAIANE        303     @servicodoemail.com     daiane@servicodoemail.com
85   HELENA        221  @dominiodoemail.com.br  helena@dominiodoemail.com.br
183   IRACI          8  @dominiodoemail.com.br   iraci@dominiodoemail.com.br
189   DALVA        137  @dominiodoemail.com.br   dalva@dominiodoemail.com.br